In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})

df

  key1 key2     data1     data2
0    a  one  0.523647  0.478969
1    a  two -1.142791 -0.152597
2    b  one -2.316508  0.466769
3    b  two  0.160620  0.577643
4    a  one  1.863450 -2.230143

In [4]:
grouped = df['data1'].groupby(by=df['key1'])
grouped

In [5]:
grouped.sum()

key1
a    1.244306
b   -2.155888
Name: data1, dtype: float64

In [6]:
grouped.mean()

key1
a    0.414769
b   -1.077944
Name: data1, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     1.193549
      two    -1.142791
b     one    -2.316508
      two     0.160620
Name: data1, dtype: float64

In [10]:
means.unstack()

key2       one       two
key1
a     1.193549 -1.142791
b    -2.316508  0.160620

In [11]:
states = np.array(['台北','台中','台中','台北','台北'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [14]:
#使用series,執行groupby()
df['data1'].groupby([states,years]).mean().unstack()

        2005      2006
台中 -1.142791 -2.316508
台北  0.342133  1.863450

In [20]:
#使用dataFrame,執行groupby()

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})

df

  key1 key2     data1     data2
0    a  one  0.122850  1.183877
1    a  two -1.357077 -1.704551
2    b  one  0.429371 -0.304005
3    b  two  0.065349 -1.000291
4    a  one  0.881155 -0.536292

In [23]:
#產生dataFrame的Groupby實體
grouped1 = df.groupby(by='key1')
grouped1

In [29]:
grouped1[['data1','data2']].mean()

         data1     data2
key1
a    -0.117691 -0.352322
b     0.247360 -0.652148